Revit 2027 API
BuiltInFailures.SketchFailures.SketchingInWrongView Property
 Detail sketch is not editable in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchingInWrongView { get; }
Public Shared ReadOnly Property SketchingInWrongView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchingInWrongView {
	FailureDefinitionId^ get ();
}
static member SketchingInWrongView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace